{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 128, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.1, "input_dtype": "float32", "batch_input_shape": [null, 19, 90], "input_length": null, "dropout_W": 0.1, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 90, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 4}}, "trainable": true, "name": "timedistributed_1"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}]}